DELIVERY_LOCATIONS = {
    'كرفور تنسويلم',
    'تنسويلم الطلحاية',
    'تنسويلم مسجد زينب',
    'كرفور كوميسيريا الزعتر',
    'الزعتر فيراج الاول',
    'عرفات الداية عشرين',
    'عرفات الداية 18',
    'عرفات الداية 18 بقالة لمغاربة',
    'عرفات الداية 15',
    'عرفات الدايات 3',
    'عرفات الداية 4',
    'طب عرفات',
    'طب الصداقة',
    'مدريد جسر الصداقة',
    'مدريد كراج',
    'مدريد جمع البيت',
    'مدريد سوق مكة',
    'مدريد ليزين',
    'سوق الاتحاد',
    'مرسة كبتال',
    'بي ام دي BMD',
    'افاركو',
    'لكبيد انخيلة',
    'الرابع والعشرين',
    'لمسيد لحمر',
    'كرفور النائب',
    'كرفور انمبيت عشرة',
    'كرفور وقفت توجونين',
}


def trial_delivery_price(pickup, delivery):
    if (pickup in DELIVERY_LOCATIONS and
            delivery in DELIVERY_LOCATIONS and pickup != delivery):
        return 100.0
    return None
